app/controllers/categories_controller.rb

  def create
    category = Category.new(category_params)

    if category.save
---
INSERT INTO "categories" ("name", "icon", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Car"], ["icon", "dollars"], ["user_id", 1], ["created_at", "2022-08-20 13:00:45.263482"], ["updated_at", "2022-08-20 13:00:45.263482"]]