app/views/categories/show.html.erb

SELECT SUM("transactions"."amount") FROM "transactions" WHERE "transactions"."category_id" = $1  [["category_id", 2]]
---
        <h2><%= @category.name %></h2>
        <h4> Total Amount: <%=@category.transactions.sum(:amount) %> $</h4>